In [1]:
import pandas as pd
import numpy as np

### Add new column in dataframe

In [82]:
df = pd.DataFrame({'Name': ['Vishakha', 'Shraddha', 'Kajal', 'Shweta'],
        'city': ['Buldhana','Nagpur','Pune','Mumbai'],
        'Qualification': ['MCA', 'MA', 'CS', 'BE']})
df

       Name      city Qualification
0  Vishakha  Buldhana           MCA
1  Shraddha    Nagpur            MA
2     Kajal      Pune            CS
3    Shweta    Mumbai            BE

In [83]:
df['fav_clr'] = ['purple', 'teal', 'red', 'orange']

In [84]:
df

       Name      city Qualification fav_clr
0  Vishakha  Buldhana           MCA  purple
1  Shraddha    Nagpur            MA    teal
2     Kajal      Pune            CS     red
3    Shweta    Mumbai            BE  orange

## Filter out rows with missing data (NaN, None, NaT)

If you have a dataframe with missing data (NaN, pd.NaT, None) you can filter out incomplete rows

NaN stands for Not A Number

NaT stands for Network Address Translation

In [2]:
df = pd.DataFrame([[0,1,2,3],
 [None,5,None,pd.NaT],
 [8,None,10,None],
 [11,12,13,pd.NaT]],columns=list('ABCD'))
df

      A     B     C     D
0   0.0   1.0   2.0     3
1   NaN   5.0   NaN   NaT
2   8.0   NaN  10.0  None
3  11.0  12.0  13.0   NaT

DataFrame.dropna drops all rows containing at least one field with missing data

## Drop missing values- dropna

In [3]:
df.dropna()

     A    B    C  D
0  0.0  1.0  2.0  3

To just drop the rows that are missing data at specified columns use subset

In [4]:
df.dropna(subset=['C'])

      A     B     C     D
0   0.0   1.0   2.0     3
2   8.0   NaN  10.0  None
3  11.0  12.0  13.0   NaT

In [3]:
df = pd.DataFrame(
        np.random.randn(5, 3),           # randn generates an array of shape (d0, d1, ..., dn)
        index=["a", "c", "e", "f", "h"],
        columns=["one", "two", "three"],
    )
df["four"] = "bar"
df["five"] = df["one"] > 0
df

        one       two     three four   five
a  0.918727  0.757387 -0.394444  bar   True
c  1.671360 -0.891120  1.574057  bar   True
e -0.492393 -0.599665 -0.198423  bar  False
f  0.929489 -0.528068  0.638496  bar   True
h -0.300611  0.110177 -1.582252  bar  False

generating missing values

In [4]:
df2 = df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
df2

        one       two     three four   five
a  0.918727  0.757387 -0.394444  bar   True
b       NaN       NaN       NaN  NaN    NaN
c  1.671360 -0.891120  1.574057  bar   True
d       NaN       NaN       NaN  NaN    NaN
e -0.492393 -0.599665 -0.198423  bar  False
f  0.929489 -0.528068  0.638496  bar   True
g       NaN       NaN       NaN  NaN    NaN
h -0.300611  0.110177 -1.582252  bar  False

## detecting missing values - isna, notna

In [7]:
df2["one"]

a   -0.200234
b         NaN
c    0.250584
d         NaN
e   -0.901329
f    0.324387
g         NaN
h   -0.221790
Name: one, dtype: float64

In [8]:
df2["one"].notna()   #notna- detects missing values

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [9]:
df2["one"].notna()   #notna- detects missing values

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [10]:
df2.isna()               #applying isna function to dataset

     one    two  three   four   five
a  False  False  False  False  False
b   True   True   True   True   True
c  False  False  False  False  False
d   True   True   True   True   True
e  False  False  False  False  False
f  False  False  False  False  False
g   True   True   True   True   True
h  False  False  False  False  False

In [11]:
df2

        one       two     three four   five
a -0.200234  0.505984 -1.194908  bar  False
b       NaN       NaN       NaN  NaN    NaN
c  0.250584  0.918470 -0.970048  bar   True
d       NaN       NaN       NaN  NaN    NaN
e -0.901329  0.248315  0.018506  bar  False
f  0.324387 -0.041348 -0.311550  bar   True
g       NaN       NaN       NaN  NaN    NaN
h -0.221790 -0.164126 -0.112201  bar  False

In [12]:
df2.dtypes.value_counts()

float64    3
object     2
dtype: int64

## Filling missing values: fillna

In [5]:
df2.fillna('0')                    #fill missing value places with specified value

        one       two     three four   five
a  0.918727  0.757387 -0.394444  bar   True
b         0         0         0    0      0
c   1.67136  -0.89112   1.57406  bar   True
d         0         0         0    0      0
e -0.492393 -0.599665 -0.198423  bar  False
f  0.929489 -0.528068  0.638496  bar   True
g         0         0         0    0      0
h -0.300611  0.110177  -1.58225  bar  False

In [15]:
df2["one"]

a   -0.200234
b         NaN
c    0.250584
d         NaN
e   -0.901329
f    0.324387
g         NaN
h   -0.221790
Name: one, dtype: float64

In [14]:
df2["one"].fillna("missing")

a   -0.200234
b     missing
c    0.250584
d     missing
e   -0.901329
f    0.324387
g     missing
h    -0.22179
Name: one, dtype: object

In [20]:
df2['one'].fillna(0)

a   -0.200234
b    0.000000
c    0.250584
d    0.000000
e   -0.901329
f    0.324387
g    0.000000
h   -0.221790
Name: one, dtype: float64

## loc and iloc

In [7]:
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

### Find all the rows based on any condition in a column

In [22]:
data.loc[data.age >= 15]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

### Find all the rows with more than one condition

In [23]:
data.loc[(data.age >= 12) & (data.gender == 'M')]

   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

### Select a range of rows using loc

we can also slice the Pandas dataframe over a range of indices

And if the indices are not numbers, then we cannot slice our dataframe.

In [8]:
data.loc[2:5]

   age section    city gender favourite_color
2   13       C  Mumbai      F          yellow
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black
5   11       A   Delhi      M           green

### Select only required columns with a condition

if our dataset contains hundreds of columns and we want to view only a few of them, then we can add a list of columns after the condition within the loc statement itself

In [26]:
data.loc[(data.age >= 12), ['city', 'gender']]

     city gender
1   Delhi      F
2  Mumbai      F
3   Delhi      M
4  Mumbai      M
6  Mumbai      F

### Update the values of a particular column on selected rows

In [27]:
data.loc[(data.age >= 12), ['section']] = 'M'
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       M    Delhi      F             NaN
2   13       M   Mumbai      F          yellow
3   21       M    Delhi      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

### Update the values of multiple columns on selected rows

In [28]:
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       M   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

### Select rows with indices using iloc

 specify the rows and columns by their integer index

In [9]:
data.iloc[[3,5]]

   age section   city gender favourite_color
3   21       B  Delhi      M             NaN
5   11       A  Delhi      M           green

### Select rows with particular indices and particular columns

#### iloc[row's index,columns's index]

In [40]:
data.iloc[[2,3,5,6],[0,2,4]]                     #iloc - used with indexing of rows and columns

   age    city favourite_color
2   13  Mumbai          yellow
3   21    Pune             NaN
5   11   Delhi           green
6   17  Mumbai             red

### Filling missing values

In [10]:
dff = pd.DataFrame(np.random.randn(10, 3), columns=list("ABC"))

In [11]:
dff

          A         B         C
0  0.146273 -0.555978 -0.018973
1  0.663506  0.113926 -1.630848
2 -0.827784  0.267040  1.531616
3 -0.068320  0.153480  1.485886
4  0.248886  0.525729 -0.323747
5  1.224884  0.763018 -0.573964
6  1.148584 -1.777338  0.301719
7  1.185620  0.441729  0.413176
8 -1.804901  0.701548 -2.387081
9  0.020752 -0.323073  2.299150

In [43]:
dff.iloc[3:5, 0] = np.nan
dff.iloc[4:6, 1] = np.nan
dff.iloc[5:8, 2] = np.nan
dff

          A         B         C
0 -1.555661 -1.651776  0.718750
1  0.150719  1.282891  0.600889
2 -1.401331 -0.462705  0.902925
3       NaN  1.100567  1.205267
4       NaN       NaN  0.093100
5  1.501938       NaN       NaN
6 -1.067397  1.368448       NaN
7  0.874317 -1.410635       NaN
8  0.498699  0.182550  2.535118
9 -0.854861  0.172136 -0.415405

In [44]:
dff.fillna(dff.mean())

          A         B         C
0 -1.555661 -1.651776  0.718750
1  0.150719  1.282891  0.600889
2 -1.401331 -0.462705  0.902925
3 -0.231697  1.100567  1.205267
4 -0.231697  0.072684  0.093100
5  1.501938  0.072684  0.805806
6 -1.067397  1.368448  0.805806
7  0.874317 -1.410635  0.805806
8  0.498699  0.182550  2.535118
9 -0.854861  0.172136 -0.415405

### Replacing values

In [15]:
ser = pd.Series([0.0, 1.0, 2.0, 3.0, 4.0])
print(ser)

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [14]:
ser.replace(0, 5)

0    5.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [48]:
ser.replace([0, 1, 2, 3, 4], [4, 3, 2, 1, 0])

0    4.0
1    3.0
2    2.0
3    1.0
4    0.0
dtype: float64

In [51]:
ser.replace({0: 7, 1: 8})

0    7.0
1    8.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [55]:
df = pd.DataFrame({"a": [22, 1, 2, 3, 4], "b": [25, 6, 7, 8, 9]})
df

    a   b
0  22  25
1   1   6
2   2   7
3   3   8
4   4   9

In [57]:
df.replace({"a": 22, "b": 25}, 40)

    a   b
0  40  40
1   1   6
2   2   7
3   3   8
4   4   9

In [17]:
df=pd.DataFrame({'A': [1, 2, 3, 4, 5, 6, 7, 8],
                   'B': [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0], 
                   'C': ['A','B', 'C', 'D', 'E', 'F', 'G', 'H'],
                   'D': [True, False, True,True, False, True, True, False]})
df

   A    B  C      D
0  1  1.0  A   True
1  2  2.0  B  False
2  3  3.0  C   True
3  4  4.0  D   True
4  5  5.0  E  False
5  6  6.0  F   True
6  7  7.0  G   True
7  8  8.0  H  False

In [18]:
df['A']

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: A, dtype: int64

In [65]:
df['A'].tolist()              #with tolist we will get all values in list - specified column

[1, 2, 3, 4, 5, 6, 7, 8]

In [67]:
df['C'].tolist()

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H']

In [68]:
df['D'].tolist()

[True, False, True, True, False, True, True, False]

In [66]:
df.tolist()                      #dataframe doesn't allow tolist function

AttributeError: 'DataFrame' object has no attribute 'tolist'

In [69]:
df['C'].to_dict()

{0: 'A', 1: 'B', 2: 'C', 3: 'D', 4: 'E', 5: 'F', 6: 'G', 7: 'H'}

In [70]:
 df.to_dict()

{'A': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8},
 'B': {0: 1.0, 1: 2.0, 2: 3.0, 3: 4.0, 4: 5.0, 5: 6.0, 6: 7.0, 7: 8.0},
 'C': {0: 'A', 1: 'B', 2: 'C', 3: 'D', 4: 'E', 5: 'F', 6: 'G', 7: 'H'},
 'D': {0: True,
  1: False,
  2: True,
  3: True,
  4: False,
  5: True,
  6: True,
  7: False}}

In [71]:
df.to_dict('records')

[{'A': 1, 'B': 1.0, 'C': 'A', 'D': True},
 {'A': 2, 'B': 2.0, 'C': 'B', 'D': False},
 {'A': 3, 'B': 3.0, 'C': 'C', 'D': True},
 {'A': 4, 'B': 4.0, 'C': 'D', 'D': True},
 {'A': 5, 'B': 5.0, 'C': 'E', 'D': False},
 {'A': 6, 'B': 6.0, 'C': 'F', 'D': True},
 {'A': 7, 'B': 7.0, 'C': 'G', 'D': True},
 {'A': 8, 'B': 8.0, 'C': 'H', 'D': False}]

### Apply function

The pandas.DataFrame.apply() method is used to apply a given function to an entire DataFrame

In [19]:
df = pd.DataFrame(np.random.randint(0,100,size = (7,2)),          # create a random DataFrame with 7 rows and 2 columns
columns = ['fst','snd'])

In [20]:
df

   fst  snd
0    8   32
1   48   57
2    8   49
3   36   97
4   87   41
5   47   26
6   65   14

In [ ]:
df1=df,

In [74]:
df.apply(np.sqrt)                            # apply the square root function to each column

        fst       snd
0  4.472136  3.316625
1  9.000000  3.162278
2  3.162278  6.633250
3  9.746794  8.944272
4  6.557439  4.242641
5  2.645751  9.000000
6  3.316625  8.062258

axis = 0 along the rows

axis = 1 along the columns

In [22]:
df

   fst  snd
0    8   32
1   48   57
2    8   49
3   36   97
4   87   41
5   47   26
6   65   14

In [24]:
df.apply(np.mean, axis=1)

0    20.0
1    52.5
2    28.5
3    66.5
4    64.0
5    36.5
6    39.5
dtype: float64

In [25]:
df.apply(np.mean, axis=0)

fst    42.714286
snd    45.142857
dtype: float64

In [78]:
df.apply(np.sum)

fst    267
snd    309
dtype: int64